use crate::white_hole::io::*;

// 対話モードのタイトル画面
pub fn print_title() {
    // 横幅は 半角79文字使えるぜ☆（＾～＾）
    // 80文字目を使うと、次の行が改行で空行になってしまう☆（＾～＾）
    IO::writeln(
        &"\
+--------- --------- --------- --------- --------- --------- --------- -------+
| KifuWarabe Shogi 2020                                                       |
+---------+--------- --------- --------- --------- --------- --------- -------+
          | Created by Muzudho (Doujin Circle Grayscale)                      |
          +--------- --------- --------- --------- --------- --------- -------+
05
          [Enter]
07
08
09
10
11
12
13
14
15
16
17
18
19
20
21
22
23\
"
        .to_string(),
    );
}
